#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_route53_zone.zone: Reading...
data.aws_iam_policy_document.cloudfront_policy: Reading...
data.aws_iam_policy_document.cloudfront_policy: Read complete after 0s [id=1010772830]
data.aws_route53_zone.zone: Read complete after 0s [id=Z0734546290TNA2OB7F9Y]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.cloudfront_4xx_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "cloudfront_4xx_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Triggers when CloudFront 4XX errors exceed 10%."
      + alarm_name                            = "Cloudwatch-4xx-Errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DistributionId" = "EL7FDHQ9QIUWK"
          + "Region"         = "Global"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "4xxErrorRate"
      + namespace                             = "AWS/Cloudfront"
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.cloudfront_5xx_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "cloudfront_5xx_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Triggers when CloudFront 5XX errors exceed 5%."
      + alarm_name                            = "Cloudwatch-5xx-Errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DistributionId" = "EL7FDHQ9QIUWK"
          + "Region"         = "Global"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "5xxErrorRate"
      + namespace                             = "AWS/Cloudfront"
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 5
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.cloudfront_latency_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "cloudfront_latency_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Triggers when CloudFront response time exceeds 500ms."
      + alarm_name                            = "Cloudwatch-High-Latency"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DistributionId" = "EL7FDHQ9QIUWK"
          + "Region"         = "Global"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "TotalResponseTime"
      + namespace                             = "AWS/Cloudfront"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 0.5
      + treat_missing_data                    = "notBreaching"
    }

  # aws_sns_topic.weathersense_cloudfront_alert will be created
  + resource "aws_sns_topic" "weathersense_cloudfront_alert" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "weathersense-cloudfront-alert-topic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.email_subscriber will be created
  + resource "aws_sns_topic_subscription" "email_subscriber" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "fidaamahboob@gmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @fidaa-mahboob, Action: `pull_request`*